app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "longurl", "shorturl", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 20 Jul 2013 12:37:42 UTC +00:00], ["longurl", "qqqqqq"], ["shorturl", "abc"], ["updated_at", Sat, 20 Jul 2013 12:37:42 UTC +00:00]]
---
	def create
		@post = Post.new(post_params)
		if @post.save